benchmark/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.8.0/share/tsung/tsung-1.0.dtd">
<tsung version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="5000" />
    </clients>

    <servers>
        <server host="127.0.0.1" port="9997" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="10" unit="second">
            <users interarrival="0.01" unit="second"/> <!-- 降低压力，先验证功能 -->
        </arrivalphase>
    </load>

    <sessions>
        <!-- 买入订单会话 -->
        <session name="ws_submit_order" probability="50" type="ts_websocket">
            <request>
                <websocket type="connect" path="/ws"/>
            </request>
            <thinktime value="1"/>

            <!-- 生成用户ID（16位数字） -->
            <setdynvars sourcetype="random_number" length="16">
                <var name="uid"/>
            </setdynvars>

            <!-- 生成买入价格（10000-10010） -->
            <setdynvars sourcetype="random_number" start="10000" end="10010">
                <var name="buy_price"/>
            </setdynvars>

            <!-- 生成数量（1-3） -->
            <setdynvars sourcetype="random_number" start="1" end="3">
                <var name="qty"/>
            </setdynvars>

            <!-- 发送买入订单（使用Tsung最原始的变量格式） -->
            <transaction name="submit_order_buy">
                <request>
                    <websocket type="message">
                        <![CDATA[{"action":"SubmitOrder","symbol":"BTCUSDT","side":"buy","price":"%%buy_price%%","quantity":"%%qty%%","user_id":"user_%%uid%%"}]]>
                    </websocket>
                </request>
            </transaction>
            <thinktime value="1"/>

            <request>
                <websocket type="close"/>
            </request>
        </session>

        <!-- 卖出订单会话 -->
        <session name="ws_submit_order_sell" probability="50" type="ts_websocket">
            <request>
                <websocket type="connect" path="/ws"/>
            </request>
            <thinktime value="1"/>

            <!-- 生成用户ID -->
            <setdynvars sourcetype="random_number" length="16">
                <var name="uid"/>
            </setdynvars>

            <for from="1" to="1" var="i">
                <!-- 生成卖出价格（10005-10015） -->
                <setdynvars sourcetype="random_number" start="10005" end="10015">
                    <var name="sell_price"/>
                </setdynvars>
                <!-- 生成数量（1-3） -->
                <setdynvars sourcetype="random_number" start="1" end="3">
                    <var name="qty"/>
                </setdynvars>
                <!-- 发送卖出订单 -->
                <transaction name="submit_order_sell">
                    <request>
                        <websocket type="message">
                            <![CDATA[{"action":"SubmitOrder","symbol":"BTCUSDT","side":"sell","price":"${sell_price}","quantity":"${qty}","user_id":"user_${uid}"}]]>
                        </websocket>
                    </request>
                </transaction>
                <thinktime value="1"/>
            </for>
            <request>
                <websocket type="close"/>
            </request>
        </session>
    </sessions>
</tsung>