benchmark/tsung.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.8.0/share/tsung/tsung-1.0.dtd">
<tsung version="1.0">
    <clients>
        <client host="localhost" use_controller_vm="true" maxusers="1000" />
    </clients>


    <servers>
        <server host="127.0.0.1" port="9997" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="100" unit="second">
            <users interarrival="0.001" unit="second"/> <!-- 降低用户创建频率（每秒1000个） -->
        </arrivalphase>
    </load>

    <sessions>
        <session name="ws_submit_order" probability="100" type="ts_websocket">
            <!-- 1. 建立WebSocket连接（握手） -->
            <request>
                <websocket type="connect" path="/ws"/>
            </request>

            <!-- 关键优化：添加固定等待时间，确保握手完成 -->
            <thinktime value="0.5" random="true"/> <!-- 握手后等待0~1秒，模拟真实用户 -->

            <!-- 2. 生成动态用户ID（可选，用于区分不同用户） -->
            <setdynvars sourcetype="random_number" length="16">
                <var name="uid"/>
            </setdynvars>

            <!-- 3. 发送业务消息（仅在握手后执行） -->
            <for from="1" to="1" var="i">
                <transaction name="submit_order">
                    <request>
                        <websocket type="message">
                            <![CDATA[{"action":"SubmitOrder","symbol":"BTCUSDT","side":"buy","price":"10000","quantity":"1","user_id":"user_${uid}"}]]>
                        </websocket>
                    </request>
                </transaction>
                <thinktime value="1" random="true"/> <!-- 业务消息后等待0~2秒，模拟真实用户 -->
            </for>

            <!-- 4. 显式关闭连接（建议添加） -->
            <request>
                <websocket type="close"/>
            </request>
        </session>
    </sessions>
</tsung>